## Latihan 2
1. Silahkan buka laman web https://github.com/selva86/datasets. Pada laman tersebut terdapat banyak file csv. Pilih salah satunya. 
2. Load datanya tanpa mendownload, gunakan laman raw file csv nya untuk mengakses datanya.
3. Lakukan eksplorasi yang paling tidak memuat :
    - Liat informasi umumnya. Coba caritahu informasi setiap kolomnya
    - Apakah terdapat missing value atau tidak. Jika ada silahkan ditindak. Bisa di hapus atau bisa di isi nilainya
    - Lakukan deskripsi terhadap datanya. Baik untuk kategorik maupun numerik
4. Buatlah fungsi untuk :
    - Membuat sebuah kolom baru, namun melibatkaan 3 kolom yang ada sebelumnya.
    - Mengisi kolom missing value dengan nilai median dari kolom tersebut. Jika tidak terdapat missing value pada data, paling tidak pilihlah 2 kolom yang kemudian nilai yang lebih dari nilai rata-ratanya diganti dengan nilai median, sedangkan sisanya diganti dengan nilai aslinya yang dibagi dengan 5
5. Buatlah sebuah dataframe baru yang merupakan grouping yang berdasarkan dengan dataframe sebelumnya. Isinya adalah nilai rata-rata, standar deviasi, nilai minimum dan nilai maksimum. Buat tampilannya berupa multi index.
6. Simpan datanya dalam format csv dengan memasukkan indexnya.

## Jawaban Latihan 2

In [2]:
import numpy as np
import pandas as pd

### Nomor 2

In [ ]:
# Mengambil data

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/GermanCredit.csv')
df.head()

### Nomor 3

In [3]:
# Melihat informasi umum

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   status                   1000 non-null   object
 1   duration                 1000 non-null   int64
 2   credit_history           1000 non-null   object
 3   purpose                  1000 non-null   object
 4   amount                   1000 non-null   int64
 5   savings                  1000 non-null   object
 6   employment_duration      1000 non-null   object
 7   installment_rate         1000 non-null   int64
 8   personal_status_sex      1000 non-null   object
 9   other_debtors            1000 non-null   object
 10  present_residence        1000 non-null   int64
 11  property                 1000 non-null   object
 12  age                      1000 non-null   int64
 13  other_installment_plans  1000 non-null   object
 14  housing                  1000 non-null   object
 15  number_credits           1000 non-null   int64
 16  job                      1000 non-null   object
 17  people_liable            1000 non-null   int64
 18  telephone                1000 non-null   object
 19  foreign_worker           1000 non-null   object
 20  credit_risk              1000 non-null   int64
dtypes: int64(8), object(13)
memory usage: 164.2+ KB

In [4]:
# Melihat jumlah missing value

df.isna().sum()

status                     0
duration                   0
credit_history             0
purpose                    0
amount                     0
savings                    0
employment_duration        0
installment_rate           0
personal_status_sex        0
other_debtors              0
present_residence          0
property                   0
age                        0
other_installment_plans    0
housing                    0
number_credits             0
job                        0
people_liable              0
telephone                  0
foreign_worker             0
credit_risk                0
dtype: int64

In [11]:
# Melihat statistika deskriptif terhadap data numerik

df.describe()

,duration,amount,installment_rate,present_residence,age,number_credits,people_liable,credit_risk
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,20.903000,3271.258000,2.973000,2.845000,35.546000,1.407000,1.155000,0.700000
std,12.058814,2822.736876,1.118715,1.103718,11.375469,0.577654,0.362086,0.458487
min,4.000000,250.000000,1.000000,1.000000,19.000000,1.000000,1.000000,0.000000
25%,12.000000,1365.500000,2.000000,2.000000,27.000000,1.000000,1.000000,0.000000
50%,18.000000,2319.500000,3.000000,3.000000,33.000000,1.000000,1.000000,1.000000
75%,24.000000,3972.250000,4.000000,4.000000,42.000000,2.000000,1.000000,1.000000
max,72.000000,18424.000000,4.000000,4.000000,75.000000,4.000000,2.000000,1.000000

In [5]:
# Melihat statistika deskriptif terhadap data kategorik

df.describe(exclude='number')

,status,credit_history,purpose,savings,employment_duration,personal_status_sex,other_debtors,property,other_installment_plans,housing,job,telephone,foreign_worker
count,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000
unique,4,5,10,5,5,4,3,4,3,3,4,2,2
top,no checking account,existing credits paid back duly till now,domestic appliances,... < 100 DM,1 <= ... < 4 years,male : single,none,car or other,none,own,skilled employee/official,no,yes
freq,394,530,280,603,339,548,907,332,814,713,630,596,963

### Nomor 4

In [6]:
# Membuat fungsi untuk membuat kolom baru dengan melibatkan 3 kolom

meand = df.mean()['duration']
meana = df.mean()['amount']

def decision(x):
    if x['credit_risk'] == 1:
        if (x['duration'] > meand) and (x['amount'] > meana):
            return 'Reject'
        else:
            return 'Hold'
    elif x['credit_risk'] == 0:
        if (x['duration'] > meand) and (x['amount'] > meana):
            return 'Considered'
        else:
            return 'OK'

In [7]:
df['dec'] = df[['duration', 'amount', 'credit_risk']].apply(decision, axis=1)

In [8]:
df[['duration', 'amount', 'credit_risk', 'dec']]

     duration  amount  credit_risk         dec
0           6    1169            1        Hold
1          48    5951            0  Considered
2          12    2096            1        Hold
3          42    7882            1      Reject
4          24    4870            0  Considered
..        ...     ...          ...         ...
995        12    1736            1        Hold
996        30    3857            1      Reject
997        12     804            1        Hold
998        45    1845            0          OK
999        45    4576            1      Reject

[1000 rows x 4 columns]

In [33]:
# Membuat fungsi untuk mengganti nilai yang > mean dengan nilai median dan sisanya diganti dengan nilai asli/5 

meanage = df.mean()['age']
medage = df.median()['age']

def change(y):
    if y['age'] > meanage:
        return medage
    else:
        return y['age']/5

In [40]:
df['agenew'] = df[['age']].apply(change,axis=1)

In [52]:
df.mean()['age']

35.546

In [53]:
df.median()['age']

33.0

In [48]:
df[['age','agenew']]

     age  agenew
0     67    33.0
1     22     4.4
2     49    33.0
3     45    33.0
4     53    33.0
..   ...     ...
995   31     6.2
996   40    33.0
997   38    33.0
998   23     4.6
999   27     5.4

[1000 rows x 2 columns]

### Nomor 5

In [56]:
df.groupby('credit_risk').agg(['mean','std','min','max']).T

credit_risk                        0             1
duration          mean     24.860000     19.207143
                  std      13.282639     11.079564
                  min       6.000000      4.000000
                  max      72.000000     60.000000
amount            mean   3938.126667   2985.457143
                  std    3535.818955   2401.472278
                  min     433.000000    250.000000
                  max   18424.000000  15857.000000
installment_rate  mean      3.096667      2.920000
                  std       1.088395      1.128078
                  min       1.000000      1.000000
                  max       4.000000      4.000000
present_residence mean      2.850000      2.842857
                  std       1.094605      1.108373
                  min       1.000000      1.000000
                  max       4.000000      4.000000
age               mean     33.963333     36.224286
                  std      11.222379     11.381145
                  min      19.000000     19.000000
                  max      74.000000     75.000000
number_credits    mean      1.366667      1.424286
                  std       0.559702      0.584721
                  min       1.000000      1.000000
                  max       4.000000      4.000000
people_liable     mean      1.153333      1.155714
                  std       0.360911      0.362844
                  min       1.000000      1.000000
                  max       2.000000      2.000000
agenew            mean     14.819333     17.754000
                  std      13.087665     13.616770
                  min       3.800000      3.800000
                  max      33.000000     33.000000

### Nomor 6

In [58]:
df.to_csv('P8-LAT2', index=True)

In [92]:
stda = df.std()['amount']
minir = df.min()['installment_rate']
maxir = df.max()['installment_rate']

def normalize(a):
    return (a['amount'] - meana) / stda

def scaleminmax(b):
    return (b['installment_rate'] - minage) / (maxir - minir)

In [93]:
df[['amount','installment_rate']]

     amount  installment_rate
0      1169                 4
1      5951                 2
2      2096                 2
3      7882                 2
4      4870                 3
..      ...               ...
995    1736                 3
996    3857                 4
997     804                 4
998    1845                 4
999    4576                 3

[1000 rows x 2 columns]

In [94]:
df['amountnormalize'] = df[['amount']].apply(normalize,axis=1)

In [95]:
df['scaleir'] = df[['installment_rate']].apply(scaleminmax, axis=1)

In [96]:
df[['amount','installment_rate', 'amountnormalize', 'scaleir']]

     amount  installment_rate  amountnormalize   scaleir
0      1169                 4        -0.744759  1.333333
1      5951                 2         0.949342  0.666667
2      2096                 2        -0.416354  0.666667
3      7882                 2         1.633430  0.666667
4      4870                 3         0.566380  1.000000
..      ...               ...              ...       ...
995    1736                 3        -0.543890  1.000000
996    3857                 4         0.207509  1.333333
997     804                 4        -0.874066  1.333333
998    1845                 4        -0.505275  1.333333
999    4576                 3         0.462226  1.000000

[1000 rows x 4 columns]

### Coretan

In [17]:
df['duration'].unique()

array([ 6, 48, 12, 42, 24, 36, 30, 15,  9, 10,  7, 60, 18, 45, 11, 27,  8,
       54, 20, 14, 33, 21, 16,  4, 47, 13, 22, 39, 28,  5, 26, 72, 40],
      dtype=int64)

In [19]:
df['duration'].nunique()

33

In [20]:
df.mean()['duration']

20.903

In [22]:
df['amount'].nunique()

921

In [24]:
df.mean()['amount']

3271.258

In [57]:
df['credit_risk'].unique()

array([1, 0], dtype=int64)

In [59]:
# meand = df.mean()['duration']
# meana = df.mean()['amount']
# def decision(decision,amount,credit_risk):
#     if credit_risk == 1:
#         if (duration > meand) or (amount > meana):
#             return 'Reject'
#         else:
#             return 'Hold'
#     elif credit_risk == 0:
#         if (duration > meand) or (amount > meana):
#             return 'Considered'
#         else:
#             return 'OK'

In [60]:
index_age = df[df['age'] > df.mean()['age']].index

In [62]:
index_age

Int64Index([  0,   2,   3,   4,   6,   8,  13,  16,  18,  20,
            ...
            976, 977, 978, 980, 987, 989, 990, 994, 996, 997],
           dtype='int64', length=412)

In [64]:
df['property'].unique()

array(['real estate', 'building society savings agreement/life insurance',
       'unknown/no property', 'car or other'], dtype=object)

In [91]:
df['age']

0      0.857143
1      0.053571
2      0.535714
3      0.464286
4      0.607143
         ...
995    0.214286
996    0.375000
997    0.339286
998    0.071429
999    0.142857
Name: age, Length: 1000, dtype: float64